tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "jesseduffield/lazygit"
# Run your GitHub Actions locally
brew "act"
# OpenType text shaping engine
brew "harfbuzz"
# Java build tool
brew "ant"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Automatic configure script builder
brew "autoconf"
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# Official Amazon AWS command-line interface
brew "awscli"
# Parser generator
brew "bison"
# Cross-platform make
brew "cmake"
# Network intrusion prevention and detection system
brew "daq"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Program that can automate interactive applications
brew "expect"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Library for encoding and decoding .avif files
brew "libavif"
# GitHub command-line tool
brew "gh"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Library access to GnuPG
brew "gpgme"
# Library to render SVG files using Cairo
brew "librsvg"
# Generic library support script
brew "libtool"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Portable abstraction of the hierarchical topology of modern architectures
brew "hwloc"
# Portable low-level networking library
brew "libdnet"
# Portable library for network traffic capture
brew "libpcap"
# Java-based project management
brew "maven"
# Run a Kubernetes cluster locally
brew "minikube"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@15"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Flexible Network Intrusion Detection System
brew "snort"
# Generate clients, server stubs, and docs from an OpenAPI spec
brew "swagger-codegen"
# Command-line packet analyzer
brew "tcpdump"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# CAD application
cask "librecad"
# Orchestrates virtual Ubuntu instances
cask "multipass"
# Replacement for Docker Desktop
cask "orbstack"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
# Team communication and collaboration software
cask "slack"
# Remote desktop software
cask "x2goclient"
# OpenJDK distribution from Azul
cask "zulu@8"
vscode "4ops.terraform"
vscode "alefragnani.bookmarks"
vscode "bierner.docs-view"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "madhavd1.javadoc-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "postman.postman-for-vscode"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "tom-latham.markdown-pdf-plus"
vscode "tomoki1207.pdf"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
